In [1]:
import numpy as np 
import pandas as pd

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    701     43   John  January      Q1
1  2023-01-02       B   West    708     98   Mary  January      Q1
2  2023-01-03       C  North    198     54    Bob  January      Q1
3  2023-01-04       D  South    294     42  Alice  January      Q1
4  2023-01-05       A   East    518     11   John  January      Q1
5  2023-01-06       B   West    628     30   Mary  January      Q1
6  2023-01-07       C  North    741     93    Bob  January      Q1
7  2023-01-08       D  South    670     61  Alice  January      Q1
8  2023-01-09       A   East    468     58   John  January      Q1
9  2023-01-10       B   West    244     74   Mary  January      Q1
10 2023-01-11       C  North    991     12    Bob  January      Q1
11 2023-01-12       D  South    840     69  Alice  January      Q1
12 2023-01-13       A   East    660     93   John  January      Q1
13 2023-01-14       B   West    644     84   Mary  January      Q1
14 2023-01-15       C  North    562     59    Bob  January      Q1
15 2023-01-16       D  South    160     26  Alice  January      Q1
16 2023-01-17       A   East    442     47   John  January      Q1
17 2023-01-18       B   West    256     57   Mary  January      Q1
18 2023-01-19       C  North    295     39    Bob  January      Q1
19 2023-01-20       D  South    541     63  Alice  January      Q1

In [6]:
pd.pivot_table(df,values="Sales",index="Region",columns="Product") #required data we have to give you can see by shift tab(None = required)

Product      A      B      C      D
Region
East     557.8    NaN    NaN    NaN
North      NaN    NaN  557.4    NaN
South      NaN    NaN    NaN  501.0
West       NaN  496.0    NaN    NaN

In [13]:
  pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     557.8    NaN    NaN    NaN  50.4   NaN   NaN   NaN
North      NaN    NaN  557.4    NaN   NaN   NaN  51.4   NaN
South      NaN    NaN    NaN  501.0   NaN   NaN   NaN  52.2
West       NaN  496.0    NaN    NaN   NaN  68.6   NaN   NaN

In [11]:
#Cross tabs
pd.crosstab(df["Region"],df["Sales"]) #sum

Sales,160,198,244,256,294,295,442,468,518,541,562,628,644,660,670,701,708,741,840,991
Region,,,,,,,,,,,,,,,,,,,,
East,0,0,0,0,0,0,1,1,1,0,0,0,0,1,0,1,0,0,0,0
North,0,1,0,0,0,1,0,0,0,0,1,0,0,0,0,0,0,1,0,1
South,1,0,0,0,1,0,0,0,0,1,0,0,0,0,1,0,0,0,1,0
West,0,0,1,1,0,0,0,0,0,0,0,1,1,0,0,0,1,0,0,0